app/controllers/airplanes_controller.rb

  def index
    @airplanes = Airplane.all
---
SELECT "airplanes".* FROM "airplanes"

  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save
---
INSERT INTO "airplanes" ("name", "columns", "rows", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "123"], ["columns", "4"], ["rows", 20], ["created_at", "2018-04-18 00:32:35.639814"], ["updated_at", "2018-04-18 00:32:35.639814"]]

    def set_airplane
      @airplane = Airplane.find(params[:id])
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]