app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT "flights".* FROM "flights"

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("airplane_id", "origin", "destination", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["airplane_id", 1], ["origin", "Sydney"], ["destination", "Brisbane"], ["date", "2018-04-21"], ["created_at", "2018-04-18 00:47:50.770761"], ["updated_at", "2018-04-18 00:47:50.770761"]]

  def destroy
    @flight.destroy
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 5]]

    def set_flight
      @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]